src/Documents/ИТСервисы_ДоговорСТехническимПровайдером/ИТСервисы_ДоговорСТехническимПровайдером.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_ДоговорСТехническимПровайдером</name>
  <registerRecords>AccumulationRegister.ИТСервисы_ДвижениеДоговоровСервисов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехПровайдер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>EnumRef.ИТСервисы_ТипыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговораУТП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговораУТП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДоговора</name>
    <type>
      <types>EnumRef.ИТСервисы_СтатусыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УслугиДоговора</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.ИТСервисы_Периоды</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ИТСервисы_ДвижениеДоговоровСервисов/ИТСервисы_ДвижениеДоговоровСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИТСервисы_ДвижениеДоговоровСервисов</name>
  <resources>
    <name>ВсегоДоговоров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоговоров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоговоровАктивных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИТСервис</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехПровайдер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ИТСервисы_СтатусыДоговоров/ИТСервисы_СтатусыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИТСервисы_СтатусыДоговоров</name>
  <enumValues>
    <name>Истек</name>
  </enumValues>
  <enumValues>
    <name>Истекает</name>
  </enumValues>
  <enumValues>
    <name>Активен</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ИТСервисы_ДоговорСТехническимПровайдером/ObjectModule.bsl
// Модуль объекта документа ДоговорСТПровайдером

// ОБРАБОТКА ПРОВЕДЕНИЯ
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Регистр ИТСервисы_ДвижениеДоговоровСервисов Приход
	Движения.ИТСервисы_ДвижениеДоговоровСервисов.Записывать = Истина;
	
	// Рассчитываем итоговую сумму из табличной части
	СуммаИтого = УслугиДоговора.Итог("Стоимость");
	
	// Если сумма в шапке не заполнена - берём из табличной части
	Если Сумма = 0 Тогда
		Сумма = СуммаИтого;
	КонецЕсли;
	
	// Добавляем движение ПРИХОД (начало договора)
	Движение = Движения.ИТСервисы_ДвижениеДоговоровСервисов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.ИТСервис = ИТСервис;
	Движение.ТехПровайдер = ТехПровайдер;
	Движение.ВсегоДоговоров = 1;
	Движение.СуммаДоговоров = Сумма;
	
	// Если договор активен - добавляем в активные
	// ВАЖНО: Проверьте точное имя перечисления в дереве (СтатусДоговора или СтатусыДоговоров)
	// Здесь я использую имя из вашего примера кода
	Если СтатусДоговора = Перечисления.ИТСервисы_СтатусыДоговоров.Активен Тогда
		Движение.ДоговоровАктивных = 1;
	КонецЕсли;
	
	// Если указана дата окончания - добавляем движение РАСХОД
	If ЗначениеЗаполнено(ДатаОкончание) Тогда
		
		Движение = Движения.ИТСервисы_ДвижениеДоговоровСервисов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		// Расход делаем НА СЛЕДУЮЩИЙ ДЕНЬ после окончания, чтобы в день окончания договор еще действовал
		Движение.Период = КонецДня(ДатаОкончание) + 1; 
		Движение.ИТСервис = ИТСервис;
		Движение.ТехПровайдер = ТехПровайдер;
		
		Движение.ВсегоДоговоров = 1;
		Движение.СуммаДоговоров = Сумма; // Списываем ту же сумму, что начислили
		
		// Если договор был активен, списываем и активность
		Если СтатусДоговора = Перечисления.ИТСервисы_СтатусыДоговоров.Активен Тогда
			Движение.ДоговоровАктивных = 1;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// ОБРАБОТКА ПРОВЕРКИ ЗАПОЛНЕНИЯ
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверяем дату окончания
	Если ЗначениеЗаполнено(ДатаОкончание) И ДатаОкончание < ДатаНачало Тогда
		// ИСПРАВЛЕНИЕ: Используем стандартный метод
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата окончания не может быть раньше даты начала!";
		Сообщение.Поле = "ДатаОкончание";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
		Отказ = Истина;
	КонецЕсли;
	
	// Проверяем табличную часть
	Если УслугиДоговора.Количество() = 0 Тогда
		// ИСПРАВЛЕНИЕ: Используем стандартный метод
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена табличная часть 'Услуги договора'!";
		Сообщение.Поле = "УслугиДоговора";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// ОБРАБОТКА ЗАПОЛНЕНИЯ
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Если создаём на основании другого документа
	If ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИТСервисы_ДоговорСТехническимПровайдером") Тогда
		
		// Копируем данные из старого договора
		ИТСервис = ДанныеЗаполнения.ИТСервис;
		ТехПровайдер = ДанныеЗаполнения.ТехПровайдер;
		ТипДоговора = ДанныеЗаполнения.ТипДоговора;
		
		// Дата начала = дата окончания старого договора + 1 день
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ДатаОкончание) Тогда
			ДатаНачало = ДанныеЗаполнения.ДатаОкончание + 86400; // +1 день
		КонецЕсли;
		
		// Копируем табличную часть
		УслугиДоговора.Загрузить(ДанныеЗаполнения.УслугиДоговора.Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

// ПЕРЕД ЗАПИСЬЮ
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Автоматически рассчитываем сумму
	Если УслугиДоговора.Количество() > 0 Тогда
		Сумма = УслугиДоговора.Итог("Стоимость");
	КонецЕсли;
	
	// Автоматически проверяем статус договора
	АктуализироватьСтатусДоговора();
	
КонецПроцедуры

// ВСПОМОГАТЕЛЬНАЯ ПРОЦЕДУРА - актуализация статуса
Процедура АктуализироватьСтатусДоговора()
	
	ТекущаяДата = ТекущаяДата();
	
	// Если дата окончания близка (< 30 дней) - статус "Истекает"
	Если ЗначениеЗаполнено(ДатаОкончание) Тогда
		РазницаДней = (ДатаОкончание - ТекущаяДата) / 86400;
		
		Если РазницаДней < 0 Тогда
			СтатусДоговора = Перечисления.ИТСервисы_СтатусыДоговоров.Истек;
		ИначеЕсли РазницаДней <= 30 Тогда
			СтатусДоговора = Перечисления.ИТСервисы_СтатусыДоговоров.Истекает;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
